Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg1_hs_device.h
// OTG_HS_DIEPTSIZ3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_MCNT                (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_MCNT_0              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DIEPDMA4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR              (0xFFFFFFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR_0            (0x1U<<0)

// OTG_HS_DTXFSTS3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS3_INEPTFSAV            (0xFFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS3_INEPTFSAV_0          (0x1U<<0)

// OTG_HS_DIEPCTL4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPENA                (0x1U<<31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPDIS                (0x1U<<30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SODDFRM              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SNAK                 (0x1U<<27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_CNAK                 (0x1U<<26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM               (0xFU<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM_0             (0x1U<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_STALL                (0x1U<<21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP                (0x3U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP_0              (0x1U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS               (0x1U<<17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID           (0x1U<<16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_USBAEP               (0x1U<<15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ                (0x7FFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ_0              (0x1U<<0)

// OTG_HS_DIEPINT4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_NAK                  (0x1U<<13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_BERR                 (0x1U<<12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_PKTDRPSTS            (0x1U<<11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_BNA                  (0x1U<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TXFIFOUDRN           (0x1U<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TXFE                 (0x1U<<7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_INEPNE               (0x1U<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_ITTXFE               (0x1U<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TOC                  (0x1U<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_EPDISD               (0x1U<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_XFRC                 (0x1U<<0)

// OTG_HS_DIEPTSIZ4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT                (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT_0              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DIEPDMA5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA5_DMAADDR              (0xFFFFFFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA5_DMAADDR_0            (0x1U<<0)

// OTG_HS_DTXFSTS4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV            (0xFFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV_0          (0x1U<<0)

// OTG_HS_DIEPCTL5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPENA                (0x1U<<31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPDIS                (0x1U<<30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SNAK                 (0x1U<<27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK                 (0x1U<<26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM               (0xFU<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM_0             (0x1U<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_STALL                (0x1U<<21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP                (0x3U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_0              (0x1U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS               (0x1U<<17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID           (0x1U<<16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP               (0x1U<<15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ                (0x7FFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_0              (0x1U<<0)

// OTG_HS_DIEPTSIZ6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_MCNT                (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_MCNT_0              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DTXFSTS6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS6_INEPTFSAV            (0xFFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS6_INEPTFSAV_0          (0x1U<<0)

// OTG_HS_DIEPINT5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_NAK                  (0x1U<<13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_BERR                 (0x1U<<12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS            (0x1U<<11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_BNA                  (0x1U<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN           (0x1U<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TXFE                 (0x1U<<7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE               (0x1U<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE               (0x1U<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TOC                  (0x1U<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD               (0x1U<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_XFRC                 (0x1U<<0)

// OTG_HS_DIEPTSIZ7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT                (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT_0              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DTXFSTS7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV            (0xFFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV_0          (0x1U<<0)

// OTG_HS_DIEPTSIZ5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT                (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_0              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DTXFSTS5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV            (0xFFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV_0          (0x1U<<0)

