Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg1_hs_device.h
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT      (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA                (0x1U<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS                (0x1U<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK                 (0x1U<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK                 (0x1U<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_STALL                (0x1U<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM                 (0x1U<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP                (0x3U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP_0              (0x1U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS               (0x1U<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID           (0x1U<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP               (0x1U<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ                (0x7FFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_NYET                 (0x1U<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP              (0x1U<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS              (0x1U<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_STUP                 (0x1U<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD               (0x1U<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_XFRC                 (0x1U<<0)

// OTG_HS_DOEPTSIZ2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT      (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA                (0x1U<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS                (0x1U<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK                 (0x1U<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK                 (0x1U<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_STALL                (0x1U<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM                 (0x1U<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP                (0x3U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP_0              (0x1U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS               (0x1U<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID           (0x1U<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP               (0x1U<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ                (0x7FFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_NYET                 (0x1U<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP              (0x1U<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS              (0x1U<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_STUP                 (0x1U<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD               (0x1U<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_XFRC                 (0x1U<<0)

// OTG_HS_DOEPTSIZ3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT      (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA                (0x1U<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS                (0x1U<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK                 (0x1U<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK                 (0x1U<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_STALL                (0x1U<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM                 (0x1U<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP                (0x3U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP_0              (0x1U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_NAKSTS               (0x1U<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EONUM_DPID           (0x1U<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_USBAEP               (0x1U<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ                (0x7FFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_NYET                 (0x1U<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP              (0x1U<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS              (0x1U<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_STUP                 (0x1U<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD               (0x1U<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_XFRC                 (0x1U<<0)

// OTG_HS_DOEPTSIZ4 Configuration

