Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg1_hs_device.h
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT      (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPENA                (0x1U<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPDIS                (0x1U<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SODDFRM              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SNAK                 (0x1U<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_CNAK                 (0x1U<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_STALL                (0x1U<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SNPM                 (0x1U<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP                (0x3U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP_0              (0x1U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_NAKSTS               (0x1U<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EONUM_DPID           (0x1U<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_USBAEP               (0x1U<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ                (0x7FFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_NYET                 (0x1U<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP              (0x1U<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS              (0x1U<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_STUP                 (0x1U<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_EPDISD               (0x1U<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_XFRC                 (0x1U<<0)

// OTG_HS_DOEPTSIZ5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT      (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPENA                (0x1U<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPDIS                (0x1U<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SODDFRM              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SNAK                 (0x1U<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_CNAK                 (0x1U<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_STALL                (0x1U<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SNPM                 (0x1U<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPTYP                (0x3U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPTYP_0              (0x1U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_NAKSTS               (0x1U<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EONUM_DPID           (0x1U<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_USBAEP               (0x1U<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ                (0x7FFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_NYET                 (0x1U<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP              (0x1U<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS              (0x1U<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_STUP                 (0x1U<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_EPDISD               (0x1U<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_XFRC                 (0x1U<<0)

// OTG_HS_DOEPTSIZ6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT      (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DOEPCTL7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPENA                (0x1U<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPDIS                (0x1U<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SODDFRM              (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SNAK                 (0x1U<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_CNAK                 (0x1U<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_STALL                (0x1U<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SNPM                 (0x1U<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP                (0x3U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP_0              (0x1U<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_NAKSTS               (0x1U<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EONUM_DPID           (0x1U<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_USBAEP               (0x1U<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ                (0x7FFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ_0              (0x1U<<0)

// OTG_HS_DOEPINT7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_NYET                 (0x1U<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP              (0x1U<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS              (0x1U<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_STUP                 (0x1U<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD               (0x1U<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_XFRC                 (0x1U<<0)

// OTG_HS_DOEPTSIZ7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT      (0x3U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT_0    (0x1U<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT              (0x3FFU<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT_0            (0x1U<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ              (0x7FFFFU<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ_0            (0x1U<<0)
